[
    {
        "id": 1,
        "chefName": "Gordon Ramsay",
        "bio": "Gordon Ramsay is a British chef, restaurateur, and television personality. He has owned and operated a number of restaurants across the world and has won numerous awards for his culinary expertise.",
        "image": "https://img.freepik.com/free-photo/portrait-smiling-chef-uniform_329181-675.jpg",
        "yearsOfExperience": 5,
        "likes": 400,
        "recipes": [
            {
                "id": 101,
                "name": "Spicy Korean Fried Chicken",
                "ingredients": [
                    "1 lb chicken wings",
                    "1/2 cup flour",
                    "1/2 tsp salt",
                    "1/2 tsp black pepper",
                    "1/2 tsp garlic powder",
                    "1/2 cup gochujang sauce"
                ],
                "method": "Preheat oven to 400°F. Line a baking sheet with parchment paper.\n2. In a large bowl, mix together flour, salt, black pepper, garlic powder, paprika, and cayenne pepper.\n3. Add chicken wings to the bowl and toss to coat with the flour mixture.\n4. Place chicken wings on the baking sheet and bake for 25-30 minutes, until golden brown and cooked through.\n5. While the chicken is baking, make the sauce. In a small saucepan, mix together gochujang sauce, honey, soy sauce, garlic, and ginger. Cook over low heat for 5 minutes",
                "rating": 4.5
            },
            {
                "id": 102,
                "name": "Spinach and Ricotta Stuffed Shells",
                "ingredients": [
                    "1 box jumbo pasta shells",
                    "15 oz ricotta cheese",
                    "1 cup grated parmesan cheese",
                    "1 egg",
                    "1/2 cup frozen spinach, thawed and drained",
                    "1 tsp garlic powder",
                    "1/2 tsp salt"
                ],
                "method": "Preheat oven to 375°F. Cook the jumbo pasta shells according to package instructions. In a large bowl, mix together ricotta cheese, parmesan cheese, egg, spinach, garlic powder, salt, and black pepper. Stuff the cooked shells with the cheese mixture and place them in a baking dish. Pour marinara sauce over the stuffed shells and top with shredded mozzarella cheese. Cover with foil and bake for 25-30 minutes. Remove the foil and bake for an additional 5-10 minutes, until the cheese is melted and bubbly.",
                "rating": 4.2
            },
            {
                "id": 103,
                "name": "Teriyaki Glazed Salmon",
                "ingredients": [
                    "4 salmon fillets",
                    "1/2 cup soy sauce",
                    "1/4 cup honey",
                    "1/4 cup rice vinegar",
                    "1 tsp garlic powder",
                    "1 tsp ginger powder",
                    "1/4 cup green onions, chopped"
                ],
                "method": " Preheat oven to 400°F. Line a baking sheet with parchment paper. In a small saucepan, mix together soy sauce, honey, rice vinegar, garlic powder, and ginger powder. Cook over low heat for 5 minutes, stirring occasionally.Pour marinara sauce over the stuffed shells and top with shredded mozzarella cheese. Cover with foil and bake for 25-30 minutes. Remove the foil and bake for an additional 5-10 minutes, until the cheese is melted and bubbly.",
                "rating": 4.5
            }
        ]
    },
    {
        "id": 2,
        "chefName": "Julia Child",
        "bio": "Julia Child was an American chef, author, and television personality. She is credited with bringing French cuisine to the American public with her cookbook, Mastering the Art of French Cooking, and her popular cooking show",
        "image": "https://media.istockphoto.com/id/1389857295/photo/african-american-woman-bakers-looking-at-camera-chef-baker-in-a-chef-dress-and-hat-cooking.jpg?b=1&s=170667a&w=0&k=20&c=s8-SqB42J9Fmo1nmtk0vrOeJJTMijxy7ojZscL7d6pc=",
        "yearsOfExperience": 4,
        "likes": 500,
        "recipes": [
            {
                "id": 201,
                "name": "Mushroom and Truffle Risotto",
                "ingredients": [
                    "1 cup Arborio rice",
                    "4 cups chicken or vegetable broth",
                    "2 tbsp butter",
                    "1 onion, chopped",
                    "3 cloves garlic, minced",
                    "8 oz mushrooms, sliced",
                    "1/4 cup white wine",
                    "1/4 cup grated parmesan cheese",
                    "2 tbsp truffle oil"
                ],
                "method": "In a large pot, heat the broth over medium heat and keep it warm. In a separate large pot, melt the butter over medium heat. Add the onion and garlic and cook until softened, about 5 minutes. Add the mushrooms and cook until they release their liquid and begin to brown, about 8 minutes. Add the Arborio rice and stir to coat in the butter and mushroom mixture. Add the white wine and stir until it is absorbed by the rice.\n6. Begin adding the warm broth to the rice, about 1 cup at a time, stirring frequently and allowing the rice to absorb the broth before adding more.",
                "rating": 4.5
            },
            {
                "id": 202,
                "name": "Spicy Grilled Shrimp Tacos",
                "ingredients": [
                    "1 lb large shrimp, peeled and deveined",
                    "1 tbsp olive oil",
                    "1 tbsp chili powder",
                    "1/2 tsp cumin",
                    "1/2 tsp smoked paprika",
                    "1/4 tsp cayenne pepper",
                    "1/4 tsp garlic powder",
                    "1/4 tsp salt",
                    "8 corn tortillas"
                ],
                "method": "Preheat a grill or grill pan to medium-high heat. In a medium bowl, combine the shrimp, olive oil, chili powder, cumin, smoked paprika, cayenne pepper, garlic powder, and salt. Toss to coat the shrimp. Grill the shrimp for 2-3 minutes per side, or until cooked through. Warm the tortillas on the grill or in a dry skillet over medium heat. Assemble the tacos by placing 2-3 shrimp on each tortilla, along with some shredded red cabbage, avocado slices, and chopped cilantro.",
                "rating": 4.2
            },
            {
                "id": 203,
                "name": "Honey Mustard Glazed Salmon",
                "ingredients": [
                    "4 salmon fillets, skin on",
                    "1/4 cup honey",
                    "2 tbsp Dijon mustard",
                    "2 tbsp whole grain mustard",
                    "1 tbsp olive oil",
                    "2 cloves garlic, minced",
                    "1 tsp dried thyme",
                    "Salt and pepper, to taste"
                ],
                "method": "Preheat the oven to 375°F (190°C). Line a baking sheet with parchment paper. In a small bowl, whisk together the honey, Dijon mustard, whole grain mustard, olive oil, garlic, and dried thyme. Season the salmon fillets with salt and pepper, and place them skin-side down on the prepared baking sheet. Brush the honey mustard glaze over the top of each fillet, covering it evenly. Bake the salmon for 12-15 minutes",
                "rating": 4.5
            }
        ]
    },
    {
        "id": 3,
        "chefName": "Jamie Oliver",
        "bio": "Jamie Oliver is a British chef, restaurateur, and television personality. He is known for his approachable style of cooking and his campaign to improve school food in the UK",
        "image": "https://media.istockphoto.com/id/951132442/photo/mastering-new-culinary-heights.jpg?s=612x612&w=0&k=20&c=96kg8oMcQ1VlItWhwRI69aAO_CWiZjHvNuvNYPiE59M=",
        "yearsOfExperience": 5,
        "likes": 600,
        "recipes": [
            {
                "id": 301,
                "name": "Vegetarian Pad Thai",
                "ingredients": [
                    "8 oz pad Thai noodles",
                    "1/4 cup vegetable oil",
                    "1 block extra-firm tofu, pressed and cubed",
                    "2 garlic cloves, minced",
                    "1/2 cup chopped scallions",
                    "2 eggs, beaten",
                    "1/4 cup soy sauce",
                    "2 tbsp brown sugar"
                ],
                "method": "Cook the pad Thai noodles according to package instructions. Drain and set aside. Heat the vegetable oil in a large skillet over medium-high heat. Add the tofu cubes and cook until golden brown on all sides, about 5-7 minutes.Remove the tofu from the skillet and set aside. In the same skillet, add the garlic and scallions and cook for 1-2 minutes, stirring constantly. Push the garlic and scallions to one side of the skillet and add the beaten eggs to the other side. Cook the eggs until set",
                "rating": 4.5
            },
            {
                "id": 302,
                "name": "Pesto Grilled Cheese Sandwich",
                "ingredients": [
                    "4 slices bread",
                    "4 slices mozzarella cheese",
                    "4 tbsp pesto sauce",
                    "2 tbsp butter",
                    "1/4 tsp salt",
                    "8 corn tortillas"
                ],
                "method": "Spread 1 tablespoon of pesto sauce on each slice of bread. Place a slice of mozzarella cheese on 2 slices of bread and top with the remaining slices of bread.. Heat a non-stick pan over medium heat.Spread 1/2 tablespoon of butter on the outside of each sandwich. Place the sandwiches in the pan and cook until golden brown on one side, about 2-3 minutes. Flip the sandwiches over and cook until the cheese is melted and the other side is golden brown, about 2-3 minutes more.",
                "rating": 4.2
            },
            {
                "id": 303,
                "name": "Greek Chicken Skewers",
                "ingredients": [
                    "1 lb boneless, skinless chicken breast, cut into 1-inch pieces",
                    "1/4 cup olive oil",
                    "1/4 cup lemon juice",
                    "2 tbsp red wine vinegar",
                    "2 garlic cloves, minced",
                    "1 tsp dried oregano",
                    "1 tsp dried thyme",
                    "1/2 tsp salt",
                    "1/4 tsp black pepper"
                ],
                "method": "In a large bowl, whisk together olive oil, lemon juice, red wine vinegar, garlic, oregano, thyme, salt, and black pepper. Add chicken pieces to the bowl and toss to coat evenly. Cover and marinate in the refrigerator for at least 30 minutes or up to 4 hours. Preheat grill to medium-high heat. Thread chicken pieces, red onion, and bell pepper onto skewers, alternating as desired.Grill skewers for 8-10 minutes, turning occasionally, until chicken is cooked through and vegetables are tender.",
                "rating": 4.5
            }
        ]
    }
]